#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/jameswcurtin/do-k8s-cluster/runs/run-MpEEqDsaNnEXCehC

Waiting for the plan to start...

Terraform v1.1.8
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
random_id.cluster_id: Refreshing state... [id=E40GLQ]
digitalocean_loadbalancer.this: Refreshing state... [id=3a2c296e-1ed9-4c19-ad61-8768af01776c]
digitalocean_record.loadbalancer_subdomain: Refreshing state... [id=306458646]
digitalocean_kubernetes_cluster.this: Refreshing state... [id=a4a2d3de-c7e7-4baa-b487-b558044f2530]
module.ingress_controller.helm_release.ingress_nginx: Refreshing state... [id=ingress-nginx]
module.external_dns.kubernetes_namespace.external_dns: Refreshing state... [id=external-dns]
module.cert_automation.helm_release.cert_manager: Refreshing state... [id=cert-manager]
module.external_dns.kubernetes_secret.digital_ocean_token: Refreshing state... [id=external-dns/digital-ocean-token]
module.external_dns.helm_release.external_dns: Refreshing state... [id=external-dns]
module.cert_automation.helm_release.cluster_issuer: Refreshing state... [id=cluster-issuer]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.gatekeeper.helm_release.gatekeeper will be created
  + resource "helm_release" "gatekeeper" {
      + atomic                     = false
      + chart                      = "gatekeeper"
      + cleanup_on_fail            = true
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = true
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 3
      + metadata                   = (known after apply)
      + name                       = "gatekeeper"
      + namespace                  = "gatekeeper-system"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://open-policy-agent.github.io/gatekeeper/charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                # See https://github.com/open-policy-agent/gatekeeper/tree/master/charts/gatekeeper
            EOT,
        ]
      + verify                     = false
      + version                    = "3.8.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.gatekeeper.kubectl_manifest.httpsonly_constraint will be created
  + resource "kubectl_manifest" "httpsonly_constraint" {
      + api_version             = "constraints.gatekeeper.sh/v1beta1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "K8sHttpsOnly"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "ingress-https-only"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: constraints.gatekeeper.sh/v1beta1
            kind: K8sHttpsOnly
            metadata:
              name: ingress-https-only
            spec:
              match:
                kinds:
                - apiGroups:
                  - extensions
                  - networking.k8s.io
                  kinds:
                  - Ingress
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.gatekeeper.kubectl_manifest.httpsonly_template will be created
  + resource "kubectl_manifest" "httpsonly_template" {
      + api_version             = "templates.gatekeeper.sh/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ConstraintTemplate"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "k8shttpsonly"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: templates.gatekeeper.sh/v1
            kind: ConstraintTemplate
            metadata:
              annotations:
                description: |-
                  Requires Ingress resources to be HTTPS only.
                  Ingress resources must: - include a valid TLS configuration - include the `kubernetes.io/ingress.allow-http` annotation, set to
                    `false`.
            
                  https://kubernetes.io/docs/concepts/services-networking/ingress/#tls
              name: k8shttpsonly
            spec:
              crd:
                spec:
                  names:
                    kind: K8sHttpsOnly
              targets:
              - rego: |
                  package k8shttpsonly
            
                  violation[{"msg": msg}] {
                    input.review.object.kind == "Ingress"
                    re_match("^(extensions|networking.k8s.io)/", input.review.object.apiVersion)
                    ingress := input.review.object
                    not https_complete(ingress)
                    msg := sprintf("Ingress should be https. tls configuration and allow-http=false annotation are required for %v", [ingress.metadata.name])
                  }
            
                  https_complete(ingress) = true {
                    ingress.spec["tls"]
                    count(ingress.spec.tls) > 0
                    ingress.metadata.annotations["kubernetes.io/ingress.allow-http"] == "false"
                  }
                target: admission.k8s.gatekeeper.sh
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.gatekeeper.kubectl_manifest.uniqueingresshost_constraint will be created
  + resource "kubectl_manifest" "uniqueingresshost_constraint" {
      + api_version             = "constraints.gatekeeper.sh/v1beta1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "K8sUniqueIngressHost"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "unique-ingress-host"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: constraints.gatekeeper.sh/v1beta1
            kind: K8sUniqueIngressHost
            metadata:
              name: unique-ingress-host
            spec:
              match:
                kinds:
                - apiGroups:
                  - extensions
                  - networking.k8s.io
                  kinds:
                  - Ingress
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.gatekeeper.kubectl_manifest.uniqueingresshost_template will be created
  + resource "kubectl_manifest" "uniqueingresshost_template" {
      + api_version             = "templates.gatekeeper.sh/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ConstraintTemplate"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "k8suniqueingresshost"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: templates.gatekeeper.sh/v1
            kind: ConstraintTemplate
            metadata:
              annotations:
                description: |-
                  Requires all Ingress rule hosts to be unique.
                  Does not handle hostname wildcards: https://kubernetes.io/docs/concepts/services-networking/ingress/
              name: k8suniqueingresshost
            spec:
              crd:
                spec:
                  names:
                    kind: K8sUniqueIngressHost
              targets:
              - rego: |
                  package k8suniqueingresshost
            
                  identical(obj, review) {
                    obj.metadata.namespace == review.object.metadata.namespace
                    obj.metadata.name == review.object.metadata.name
                  }
            
                  violation[{"msg": msg}] {
                    input.review.kind.kind == "Ingress"
                    re_match("^(extensions|networking.k8s.io)$", input.review.kind.group)
                    host := input.review.object.spec.rules[_].host
                    other := data.inventory.namespace[_][otherapiversion]["Ingress"][name]
                    re_match("^(extensions|networking.k8s.io)/.+$", otherapiversion)
                    other.spec.rules[_].host == host
                    not identical(other, input.review)
                    msg := sprintf("ingress host conflicts with an existing ingress <%v>", [host])
                  }
                target: admission.k8s.gatekeeper.sh
        EOT
      + yaml_incluster          = (sensitive value)
    }

Plan: 5 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @jamescurtin, Action: `pull_request`*